Elecrow-RD/CrowPanel-3.5-HMI-ESP32-Display-480x320/example/V2.2/ESP_IDF/LVGL_IDF/sdkconfig.defaults
# ESP-IDF 5.5.4 defaults for CrowPanel ESP32 3.5

CONFIG_IDF_TARGET="esp32"

# Arduino requires 1000 Hz tick rate
CONFIG_FREERTOS_HZ=1000

# Arduino as ESP-IDF component
CONFIG_ENABLE_ARDUINO_DEPENDS=y
CONFIG_ARDUINO_VARIANT="esp32"
# CONFIG_AUTOSTART_ARDUINO is not set

# CrowPanel 3.5 TFT via menuconfig (ILI9488, 480x320)
CONFIG_TFT_eSPI_ESPIDF=y
CONFIG_TFT_ILI9488_DRIVER=y
CONFIG_TFT_INVERSION_DISABLE=y
CONFIG_TFT_VSPI_PORT=y
CONFIG_TFT_MISO=33
CONFIG_TFT_MOSI=13
CONFIG_TFT_SCLK=14
CONFIG_TFT_CS=15
CONFIG_TFT_DC=2
CONFIG_TFT_RST=-1
CONFIG_TFT_BL=27
CONFIG_TFT_BACKLIGHT_ON_LOW=y
CONFIG_TFT_SPI_FREQUENCY=16000000

# LVGL 8.3.11 settings used by the SquareLine-generated UI
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
